app/controllers/products_controller.rb

SELECT  "products".* FROM "products"  WHERE (LOWER(name) LIKE LOWER('%99%')) LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "products"  WHERE (LOWER(name) LIKE LOWER('%99%'))
SELECT  "products".* FROM "products"   ORDER BY products.created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    @products = if params[:search]
      Product.where("LOWER(name) LIKE LOWER(?)", "%#{params[:search]}%").page(params[:page])
    else
      @products = Product.order('products.created_at DESC').page(params[:page])

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."product_id" = ?  [["product_id", 9]]
---
  def show
    # @product = Product.find(params[:id])
    if current_user
      @review = @product.reviews.build
    end

    @reviews = Review.all

INSERT INTO "products" ("created_at", "description", "name", "price_in_cents", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-10 23:46:12.329782"], ["description", "khalna nshoof itha zabat"], ["name", "Test actual adding"], ["price_in_cents", 20000], ["updated_at", "2014-11-10 23:46:12.329782"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["description", "Good EDIT bla bla bla"], ["updated_at", "2014-11-11 00:05:00.635663"]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)