app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "ljhsbcpiqwbckw"], ["created_at", "2014-11-11 02:28:49.714912"], ["product_id", 9], ["updated_at", "2014-11-11 02:28:49.714912"], ["user_id", 2]]
---
  def create
    @review = @product.reviews.build(review_params)
    @review.user = current_user

    respond_to do |format|
      if @review.save

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 121]]
---
  def load_product
    @product = Product.find(params[:product_id])