app/views/products/_reviews.html.erb

<% @product.reviews.all.each do |review| %>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."product_id" = ?  [["product_id", 121]]

  <p> <%= review.comment %></p>
  <p><em><%= review.created_at %></em> </p>
---
INSERT INTO "reviews" ("comment", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "NEWER AJAX REVIEW\r\n"], ["created_at", "2014-11-26 21:44:00.198040"], ["product_id", 121], ["updated_at", "2014-11-26 21:44:00.198040"], ["user_id", 6]]