app/views/products/show.html.erb

<% if current_user %>
<% @product.reviews.all.each do |review| %>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."product_id" = ?  [["product_id", 9]]